src/toir_cfe/src/Reports/проф_ЖурналУчетаЗаявочныхРемонтовЗаМесяц/проф_ЖурналУчетаЗаявочныхРемонтовЗаМесяц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>проф_ЖурналУчетаЗаявочныхРемонтовЗаМесяц</name>
</mdclass:Report>

src/toir_cfe/src/InformationRegisters/торо_ИнтеграцияДокументов/торо_ИнтеграцияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="17a02a98-8e64-4576-9b3b-4cfc58e2d8cf">
  <name>торо_ИнтеграцияДокументов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <dimensions extendedConfigurationObject="e9a88077-61c6-452d-90f2-47d4f24e77da">
    <name>ID</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="4736aca1-8591-4fd1-81ac-2e197db4fc05">
    <name>ДокументТОИР</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="e9f3faae-f405-4f24-9277-030e531fcfbb">
    <name>ДокументЕРП</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cfe/src/Documents/торо_ЗаявкаНаРемонт/торо_ЗаявкаНаРемонт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="145aacdb-f868-47fa-a11a-64c1ee401e0c">
  <name>торо_ЗаявкаНаРемонт</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="0897f476-6166-46f5-b06b-269173e4520e">
    <name>проф_СтатусСогласования</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="03e32b56-c47c-4bc5-93ac-0da2e38d3c38">
    <name>проф_Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e09e8e0e-2544-4812-8554-4a3ee2dc14b2">
    <name>проф_НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7ed39b61-bbcb-4d6e-853d-79611e8e5aff">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="2f6af02a-4b40-4613-8cc7-8b4a64e0e244">
    <name>РемонтыОборудования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="ccc4499d-64f9-48a4-98c6-612249fc206f">
      <name>ОбъектРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="45912545-c381-435b-9239-8860ec2db3af">
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cfe/src/Documents/торо_ВыявленныеДефекты/торо_ВыявленныеДефекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="bf35ff03-c641-42bf-90fc-6469235dafc0">
  <name>торо_ВыявленныеДефекты</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections extendedConfigurationObject="8b164589-2f76-44c2-86db-13b16b9df744">
    <name>СписокДефектов</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="2cd062c3-ed73-4f60-acc5-8ad2b64fc56a">
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cfe/src/Documents/торо_АктОВыполненииЭтапаРабот/торо_АктОВыполненииЭтапаРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b863b14e-c352-4234-8c63-d86d97f12044">
  <name>торо_АктОВыполненииЭтапаРабот</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections extendedConfigurationObject="6a750754-4a73-402d-8f35-6a379ec1cb60">
    <name>ДокументыОснования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="23087b8e-d21e-4499-beac-8287045096a2">
      <name>ДокументОснование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="35c6e5ea-774c-4081-b20e-6b7733152e33">
    <name>РемонтыОборудования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="f458fa39-e462-44c2-a688-fb165a2c6c8d">
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="41c9c7b6-5db5-492f-8a78-0e1fb54a88c4">
      <name>ОбъектРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cfe/src/Documents/ВнутреннееПотреблениеТоваров/ВнутреннееПотреблениеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b726b4a4-d691-4fa0-bef7-e6f1bd056cbf">
  <name>ВнутреннееПотреблениеТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="6ac93f4f-ec62-46e7-b4ca-38e795bf02db">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9bf2417c-ed59-4c71-a254-2f2338f41425">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4f821681-4f9b-4186-85f8-a081e4ab09cf">
    <name>ПотреблениеПоЗаказам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8f13106d-31d1-441b-8330-ef025f55fdbf">
    <name>ЗаказНаВнутреннееПотребление</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5a69f874-6aec-457e-8ade-4fb7762659ab">
    <name>проф_ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="048b6482-1229-4a9b-bde1-a32f6b28cf3d">
    <name>проф_ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c978a924-8a72-4669-a86a-a1e5e31fd099">
    <name>ЕстьРасхождения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="385ab3ce-dd41-4c25-b89b-974bb478f380">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="54be410d-2466-478e-8cf5-434ec98e19f1">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1b8217a5-5b59-453d-b479-c9c962e72312">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="39aa0f15-c415-409c-a64b-12fd0ee1e845">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cfe/src/Catalogs/торо_ОбъектыРемонта/торо_ОбъектыРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="bc7402bd-d283-40c7-9b61-dde80fafb3d8">
  <name>торо_ОбъектыРемонта</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="213a88d1-10cd-4415-be87-6466d619cd88">
    <name>ТиповойОР</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="47fb0293-feaf-4992-8644-4f79efbe139f">
    <name>Изготовитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0b0e085f-b80a-45ba-8729-f3d02e881457">
    <name>Направление</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ea3c21ff-2af7-4916-a866-e5b01c2fea11">
    <name>ДатаВводаВЭксплуатацию</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b5ba0323-3b01-46d2-9bde-8c0207e1cb21">
    <name>ДатаВыпуска</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9f4d4241-b7f9-404c-96be-63c46d087525">
    <name>ШтрихКод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="99b876ea-2a2a-4f0e-9d42-e4fb5ff631da">
    <name>ТипОбъекта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b3a58cb8-2443-4009-b5f6-f4cb4f657cb7">
    <name>ИнвентарныйНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="db977b56-8d4f-477d-bacd-96c656f0c4e2">
    <name>ЗаводскойНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="eebb6ad6-7b6c-4e39-8fe5-992da135c1dd">
    <name>ТехНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="5761f0bd-211f-4da4-82fc-476910d2db04">
    <name>проф_НормативныеРемонты</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="757bfdf7-b0f2-4ce9-bf65-9a73743034b9">
    <name>проф_ПредшествующиеРемонты</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="27d1aabe-5590-4b8a-92b6-17540e81adc7">
    <name>проф_ЗамещаемыеРемонты</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="ee9e378e-a344-4a59-a2a5-054789005c8d">
    <name>проф_ТабличноеПолеРемонтныеЦиклыОборудования</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="f450d93a-cf39-4570-a8cc-896795681912">
    <name>проф_РемЦиклыОборудования</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="e01b6f5d-fe35-434f-87a5-1ce36557d3e2">
    <name>проф_ТабЗапчастейОбъектовРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="0bdcaf87-2304-461b-9957-e534bec7fb10">
    <name>проф_ТабЗатратПоВидамРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="c30740dc-2210-44f4-be97-a6f7b8e216b1">
    <name>проф_ГарантииОбъектаРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Catalog>

src/toir_cfe/src/Reports/проф_ЖурналУчетаЗаявочныхРемонтовЗаМесяц/Forms/ФормаОтчета/Module.bsl
//++ Проф-ИТ, #128, Башинская А., 25.08.2023

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
   
   ПериодОтчета.Вариант = ВариантСтандартногоПериода.Месяц;
   ПериодОтчета.ДатаНачала = НачалоМесяца(ОбщегоНазначенияКлиент.ДатаСеанса());     
   ПериодОтчета.ДатаОкончания = КонецМесяца(ОбщегоНазначенияКлиент.ДатаСеанса()); 
   
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)
   СформироватьНаСервере();
КонецПроцедуры 

&НаКлиенте
Процедура Печать(Команда)
   
   Идентификатор = "ИД_ПечатьЖурналУчетаЗаявочныхРемонтовЗаМесяц";
	   
   КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(Идентификатор);
   ОписаниеПечатнойФормы = УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, Идентификатор);
   ОписаниеПечатнойФормы.ТабличныйДокумент = ПолучитьДокументДляПечати();
   
   УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, , ЭтаФорма);
   
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьНаСервере()
   ВывестиОтчет();
КонецПроцедуры

&НаСервере
Процедура ВывестиОтчет()
   
   Табл = ТЧОтчет; 
   Табл.Очистить();
   ЭтаОбработка = РеквизитФормыВЗначение("Отчет");
   Макет = ЭтаОбработка.ПолучитьМакет("Макет");
   ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
   ОбластьШапка2 = Макет.ПолучитьОбласть("Шапка2");
   
   Запрос = Новый Запрос;
   Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(ПериодОтчета.ДатаНачала)); 
   Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(ПериодОтчета.ДатаОкончания));   
   Запрос.Текст = ТекстЗапросаПечатьЖурналУчетаЗаявочныхРемонтовЗаМесяц(ОбъектРемонта, Запрос);        
   РезультатЗапроса = Запрос.ВыполнитьПакет();  
   
   ВыборкаОбъектыРемонта = РезультатЗапроса[5].Выбрать();
   ВыборкаНаработка = РезультатЗапроса[3].Выбрать();
   ВыборкаНоменклатура = РезультатЗапроса[4].Выбрать();
   
   Если ВыборкаОбъектыРемонта.Количество() > 0 Тогда	
	   Табл.Вывести(ОбластьШапка); 
   КонецЕсли;
   
   Пока ВыборкаОбъектыРемонта.Следующий() Цикл
	   ОбластьСтрока = Макет.ПолучитьОбласть("ОбластьСтрока");
	   ОбластьСтрока.Параметры.Заполнить(ВыборкаОбъектыРемонта); 
	   ОбластьСтрока.Параметры.Наименование = ВыборкаОбъектыРемонта.Наименование + " " + ВыборкаОбъектыРемонта.Марка;
	   ОбластьСтрока.Параметры.Пробег = "";
	   ОбластьСтрока.Параметры.Наработка = "";
	   
	   Отбор = Новый Структура;
	   Отбор.Вставить("ОбъектРемонта", ВыборкаОбъектыРемонта.ОбъектРемонта);
	   Отбор.Вставить("ID", ВыборкаОбъектыРемонта.ID);
	   
	   ЗаполнитьПробег(Отбор, ВыборкаНаработка, ОбластьСтрока);
	   
	   ОбластьСтрока.Параметры.ВремяРаботы = ?(ЗначениеЗаполнено(ВыборкаОбъектыРемонта.ВремяРаботы),
												   Строка(ВыборкаОбъектыРемонта.ВремяРаботы) + ", ч",
												   "");  
	   ОбластьСтрока.Параметры.ВремяПростоя = ?(ЗначениеЗаполнено(ВыборкаОбъектыРемонта.ВремяПростоя),
												   Строка(ВыборкаОбъектыРемонта.ВремяПростоя) + ", ч",
												   "");
	   Табл.Вывести(ОбластьСтрока); 
	   
	   ВывестиВыборкуНоменклатуры(ВыборкаОбъектыРемонта, ВыборкаНоменклатура, ОбластьШапка2, Макет, Табл);
			   
   КонецЦикла;
		   
КонецПроцедуры 

&НаСервере
Процедура ВывестиВыборкуНоменклатуры(ВыборкаОбъектыРемонта, ВыборкаНоменклатура, ОбластьШапка2, Макет, ТабДок)
   
   Отбор = Новый Структура;
   Отбор.Вставить("ОбъектРемонта", ВыборкаОбъектыРемонта.ОбъектРемонта);
   Отбор.Вставить("ID", ВыборкаОбъектыРемонта.ID);
   ШапкаВыведена = Ложь;
   Пока ВыборкаНоменклатура.НайтиСледующий(Отбор) Цикл
	   
	   Если ШапкаВыведена = Ложь Тогда
		   ТабДок.Вывести(ОбластьШапка2);
		   ШапкаВыведена = Истина;
	   КонецЕсли;
	   
	   ОбластьСтрока2 = Макет.ПолучитьОбласть("ОбластьСтрока2");
	   ОбластьСтрока2.Параметры.Заполнить(ВыборкаНоменклатура);
	   ТабДок.Вывести(ОбластьСтрока2);	
   КонецЦикла;	
   ВыборкаНоменклатура.Сбросить();
   
КонецПроцедуры

&НаСервере
Функция ТекстЗапросаПечатьЖурналУчетаЗаявочныхРемонтовЗаМесяц(ОбъектРемонта, Запрос)
   
   ТекстЗапроса = "ВЫБРАТЬ
                  |	торо_ВыявленныеДефектыСписокДефектов.ОбъектРемонта КАК ОбъектРемонта,
                  |	торо_ВыявленныеДефектыСписокДефектов.ID КАК ID,
                  |	ЕСТЬNULL(торо_ОбъектыРемонта.ИнвентарныйНомер, """") КАК ИнвентарныйНомер,
                  |	ЕСТЬNULL(торо_ОбъектыРемонта.Наименование, """") КАК Наименование,
                  |	ЕСТЬNULL(торо_ОбъектыРемонта.проф_Марка, """") КАК проф_Марка,
                  |	ЕСТЬNULL(торо_ОбъектыРемонта.ЗаводскойНомер, """") КАК ЗаводскойНомер,
//++ Проф-ИТ, #296, Горетовская М.С., 05.10.2023 - Доработки по задаче #128
                  |	ЕСТЬNULL(торо_ОбъектыРемонта.проф_Госномер, """") КАК ГосНомер,
//-- Проф-ИТ, #296, Горетовская М.С., 05.10.2023 - Доработки по задаче #128
                  |	ЕСТЬNULL(торо_ЗаявкаНаРемонтРемонтыОборудования.ДатаНачала, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаНачала,
                  |	ЕСТЬNULL(торо_ЗаявкаНаРемонтРемонтыОборудования.ДатаОкончания, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОкончания,
                  |	торо_ВыявленныеДефектыСписокДефектов.ДефектОписание КАК ДефектОписание,
                  |	ЕСТЬNULL(торо_ОбъектыРемонта.ПлановыйГрафикРаботы, """") КАК ПлановыйГрафикРаботы,
                  |	торо_ВыявленныеДефектыСписокДефектов.ДефектПричина КАК ДефектПричина,
                  |	ЕСТЬNULL(торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка, ЗНАЧЕНИЕ(Документ.торо_ЗаявкаНаРемонт.ПустаяСсылка)) КАК ЗаявкаНаРемонт,
                  |	СУММА(ВЫРАЗИТЬ(торо_АктОВыполненииЭтапаРаботТрудовыеЗатраты.ВремяРаботы / 3600 КАК ЧИСЛО(12, 2))) КАК ВремяРаботы,
                  |	ЕСТЬNULL(торо_Наработка.Значение, 0) КАК Наработка,
                  |	ЕСТЬNULL(торо_Пробег.Значение, 0) КАК Пробег
                  |ПОМЕСТИТЬ ВТ_Предв
                  |ИЗ
                  |	Документ.торо_ВыявленныеДефекты.СписокДефектов КАК торо_ВыявленныеДефектыСписокДефектов
                  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ВыявленныеДефекты КАК торо_ВыявленныеДефекты
                  |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ВыявленныеДефекты.ДополнительныеРеквизиты КАК торо_Пробег
                  |			ПО торо_ВыявленныеДефекты.Ссылка = торо_Пробег.Ссылка
                  |				И (торо_Пробег.Свойство.Наименование = ""Пробег"")
                  |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ВыявленныеДефекты.ДополнительныеРеквизиты КАК торо_Наработка
                  |			ПО торо_ВыявленныеДефекты.Ссылка = торо_Наработка.Ссылка
                  |				И (торо_Наработка.Свойство.Наименование = ""Наработка"")
                  |		ПО торо_ВыявленныеДефектыСписокДефектов.Ссылка = торо_ВыявленныеДефекты.Ссылка
                  |			И (торо_ВыявленныеДефекты.ПометкаУдаления = ЛОЖЬ)
                  |			И (торо_ВыявленныеДефекты.Проведен)
                  |			И (&ОбъектРемонта)
                  |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
                  |		ПО торо_ВыявленныеДефектыСписокДефектов.ОбъектРемонта = торо_ОбъектыРемонта.Ссылка
                  |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК торо_ЗаявкаНаРемонтРемонтыОборудования
                  |		ПО (торо_ЗаявкаНаРемонтРемонтыОборудования.ID = торо_ВыявленныеДефектыСписокДефектов.ID)
                  |			И (торо_ОбъектыРемонта.Ссылка = торо_ЗаявкаНаРемонтРемонтыОборудования.ОбъектРемонта)
                  |			И (торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка.Проведен)
                  |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.ТрудовыеЗатраты КАК торо_АктОВыполненииЭтапаРаботТрудовыеЗатраты
                  |		ПО торо_ВыявленныеДефектыСписокДефектов.ID = торо_АктОВыполненииЭтапаРаботТрудовыеЗатраты.РемонтыОборудования_ID
                  |			И (торо_АктОВыполненииЭтапаРаботТрудовыеЗатраты.Ссылка.Проведен)
                  |ГДЕ
                  |	НАЧАЛОПЕРИОДА(торо_ЗаявкаНаРемонтРемонтыОборудования.ДатаНачала, МЕСЯЦ) = &ДатаНачала
                  |
                  |СГРУППИРОВАТЬ ПО
                  |	торо_ВыявленныеДефектыСписокДефектов.ОбъектРемонта,
                  |	торо_ВыявленныеДефектыСписокДефектов.ID,
                  |	ЕСТЬNULL(торо_ОбъектыРемонта.ИнвентарныйНомер, """"),
                  |	ЕСТЬNULL(торо_ОбъектыРемонта.Наименование, """"),
                  |	ЕСТЬNULL(торо_ОбъектыРемонта.проф_Марка, """"),
                  |	ЕСТЬNULL(торо_ОбъектыРемонта.ЗаводскойНомер, """"),
 //++ Проф-ИТ, #296, Горетовская М.С., 05.10.2023 - Доработки по задаче #128
                  |	ЕСТЬNULL(торо_ОбъектыРемонта.проф_Госномер, """"),
//-- Проф-ИТ, #296, Горетовская М.С., 05.10.2023 - Доработки по задаче #128
                 |	торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка,
                  |	ЕСТЬNULL(торо_ЗаявкаНаРемонтРемонтыОборудования.ДатаНачала, ДАТАВРЕМЯ(1, 1, 1)),
                  |	ЕСТЬNULL(торо_ЗаявкаНаРемонтРемонтыОборудования.ДатаОкончания, ДАТАВРЕМЯ(1, 1, 1)),
                  |	торо_ВыявленныеДефектыСписокДефектов.ДефектОписание,
                  |	торо_ОбъектыРемонта.ПлановыйГрафикРаботы,
                  |	торо_ВыявленныеДефектыСписокДефектов.ДефектПричина,
                  |	ЕСТЬNULL(торо_Наработка.Значение, 0),
                  |	ЕСТЬNULL(торо_Пробег.Значение, 0)
                  |
                  |ИНДЕКСИРОВАТЬ ПО
                  |	ОбъектРемонта,
                  |	ДатаНачала
                  |;
                  |
                  |////////////////////////////////////////////////////////////////////////////////
                  |ВЫБРАТЬ
                  |	ВТ_Предв.ОбъектРемонта КАК ОбъектРемонта,
                  |	ВТ_Предв.ID КАК ID,
                  |	ВТ_Предв.ИнвентарныйНомер КАК ИнвентарныйНомер,
                  |	ВТ_Предв.Наименование КАК Наименование,
                  |	ВТ_Предв.проф_Марка КАК проф_Марка,
                  |	ВТ_Предв.ЗаводскойНомер КАК ЗаводскойНомер,
//++ Проф-ИТ, #296, Горетовская М.С., 05.10.2023 - Доработки по задаче #128
                  |	ВТ_Предв.ГосНомер КАК ГосНомер,
//-- Проф-ИТ, #296, Горетовская М.С., 05.10.2023 - Доработки по задаче #128
                  |	ВТ_Предв.ЗаявкаНаРемонт КАК ЗаявкаНаРемонт,
                  |	ВТ_Предв.ДатаНачала КАК ДатаНачала,
                  |	ВТ_Предв.ДатаОкончания КАК ДатаОкончания,
                  |	ВТ_Предв.ДефектОписание КАК ДефектОписание,
                  |	ВТ_Предв.ПлановыйГрафикРаботы КАК ПлановыйГрафикРаботы,
                  |	ВТ_Предв.ДефектПричина КАК ДефектПричина,
                  |	ВТ_Предв.ВремяРаботы КАК ВремяРаботы,
                  |	СУММА(РАЗНОСТЬДАТ(ЕСТЬNULL(торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ДатаНачала, ДАТАВРЕМЯ(1, 1, 1)), ЕСТЬNULL(торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ДатаОкончания, ДАТАВРЕМЯ(1, 1, 1)), ЧАС)) КАК ВремяПростоя,
                  |	ВТ_Предв.Наработка КАК Наработка,
                  |	ВТ_Предв.Пробег КАК Пробег
                  |ПОМЕСТИТЬ ВТ_Итог
                  |ИЗ
                  |	ВТ_Предв КАК ВТ_Предв
                  |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.РемонтыОборудования КАК торо_АктОВыполненииЭтапаРаботРемонтыОборудования
                  |		ПО (торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ID = ВТ_Предв.ID)
                  |			И ВТ_Предв.ОбъектРемонта = торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ОбъектРемонта
                  |
                  |СГРУППИРОВАТЬ ПО
                  |	ВТ_Предв.ОбъектРемонта,
                  |	ВТ_Предв.ID,
                  |	ВТ_Предв.ИнвентарныйНомер,
                  |	ВТ_Предв.Наименование,
                  |	ВТ_Предв.ЗаявкаНаРемонт,
                  |	ВТ_Предв.проф_Марка,
                  |	ВТ_Предв.ЗаводскойНомер,
//++ Проф-ИТ, #296, Горетовская М.С., 05.10.2023 - Доработки по задаче #128
                  |	ВТ_Предв.ГосНомер,
//-- Проф-ИТ, #296, Горетовская М.С., 05.10.2023 - Доработки по задаче #128
                  |	ВТ_Предв.ДатаНачала,
                  |	ВТ_Предв.ДатаОкончания,
                  |	ВТ_Предв.ДефектОписание,
                  |	ВТ_Предв.ПлановыйГрафикРаботы,
                  |	ВТ_Предв.ДефектПричина,
                  |	ВТ_Предв.ВремяРаботы,
                  |	ВТ_Предв.Наработка,
                  |	ВТ_Предв.Пробег
                  |
                  |ИНДЕКСИРОВАТЬ ПО
                  |	ОбъектРемонта,
                  |	ID
                  |;
                  |
                  |////////////////////////////////////////////////////////////////////////////////
                  |ВЫБРАТЬ
                  |	ВТ_Итог.ОбъектРемонта КАК ОбъектРемонта,
                  |	ВТ_Итог.ID КАК ID,
                  |	ВТ_Итог.ИнвентарныйНомер КАК ИнвентарныйНомер,
                  |	ВТ_Итог.Наименование КАК Наименование,
                  |	ВТ_Итог.проф_Марка КАК проф_Марка,
                  |	ВТ_Итог.ЗаводскойНомер КАК ЗаводскойНомер,
                  |	ВТ_Итог.ЗаявкаНаРемонт КАК ЗаявкаНаРемонт,
                  |	ВТ_Итог.ДатаНачала КАК ДатаНачала,
                  |	ВТ_Итог.ДатаОкончания КАК ДатаОкончания,
                  |	ВТ_Итог.ДефектОписание КАК ДефектОписание,
                  |	ВТ_Итог.ПлановыйГрафикРаботы КАК ПлановыйГрафикРаботы,
                  |	ВТ_Итог.ДефектПричина КАК ДефектПричина,
                  |	ВТ_Итог.ВремяРаботы КАК ВремяРаботы,
                  |	ВТ_Итог.ВремяПростоя КАК ВремяПростоя,
                  |	ВТ_Итог.Наработка КАК Наработка,
                  |	ВТ_Итог.Пробег КАК Пробег
                  |ПОМЕСТИТЬ ВТ_ИтогСНаработками
                  |ИЗ
                  |	ВТ_Итог КАК ВТ_Итог
                  |
                  |СГРУППИРОВАТЬ ПО
                  |	ВТ_Итог.ОбъектРемонта,
                  |	ВТ_Итог.ID,
                  |	ВТ_Итог.ИнвентарныйНомер,
                  |	ВТ_Итог.Наименование,
                  |	ВТ_Итог.ЗаявкаНаРемонт,
                  |	ВТ_Итог.проф_Марка,
                  |	ВТ_Итог.ЗаводскойНомер,
                  |	ВТ_Итог.ДатаНачала,
                  |	ВТ_Итог.ДатаОкончания,
                  |	ВТ_Итог.ДефектОписание,
                  |	ВТ_Итог.ПлановыйГрафикРаботы,
                  |	ВТ_Итог.ДефектПричина,
                  |	ВТ_Итог.ВремяРаботы,
                  |	ВТ_Итог.ВремяПростоя,
                  |	ВТ_Итог.Наработка,
                  |	ВТ_Итог.Пробег
                  |
                  |ИНДЕКСИРОВАТЬ ПО
                  |	ОбъектРемонта,
                  |	ID
                  |;
                  |
                  |////////////////////////////////////////////////////////////////////////////////
                  |ВЫБРАТЬ
                  |	ВТ_ИтогСНаработками.ОбъектРемонта КАК ОбъектРемонта,
                  |	ВТ_ИтогСНаработками.ID КАК ID,
                  |	ЕСТЬNULL(ВТ_ИтогСНаработками.Наработка, 0) КАК Наработка,
                  |	ЕСТЬNULL(ВТ_ИтогСНаработками.Пробег, 0) КАК Пробег
                  |ИЗ
                  |	ВТ_ИтогСНаработками КАК ВТ_ИтогСНаработками
                  |
                  |СГРУППИРОВАТЬ ПО
                  |	ВТ_ИтогСНаработками.ОбъектРемонта,
                  |	ВТ_ИтогСНаработками.ID,
                  |	ВТ_ИтогСНаработками.Наработка,
                  |	ВТ_ИтогСНаработками.Пробег
                  |
                  |УПОРЯДОЧИТЬ ПО
                  |	ОбъектРемонта
                  |;
                  |
                  |////////////////////////////////////////////////////////////////////////////////
                  |ВЫБРАТЬ
                  |	ЕСТЬNULL(ВнутреннееПотреблениеТоваровТовары.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
                  |	СУММА(ЕСТЬNULL(ВнутреннееПотреблениеТоваровТовары.Количество, 0)) КАК Количество,
                  |	ВТ_Итог.ОбъектРемонта КАК ОбъектРемонта,
                  |	ВТ_Итог.ID КАК ID
                  |ИЗ
                  |	ВТ_Итог КАК ВТ_Итог
                  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ИнтеграцияДокументов КАК торо_ИнтеграцияДокументов
                  |		ПО ВТ_Итог.ID = торо_ИнтеграцияДокументов.ID
                  |			И (ТИПЗНАЧЕНИЯ(торо_ИнтеграцияДокументов.ДокументЕРП) = ТИП(Документ.ВнутреннееПотреблениеТоваров))
                  |			И (НЕ торо_ИнтеграцияДокументов.ДокументЕРП.ПометкаУдаления)
                  |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВнутреннееПотреблениеТоваров.Товары КАК ВнутреннееПотреблениеТоваровТовары
                  |		ПО (торо_ИнтеграцияДокументов.ДокументЕРП = ВнутреннееПотреблениеТоваровТовары.Ссылка)
                  |			И (ВнутреннееПотреблениеТоваровТовары.Ссылка.Проведен)
                  |ГДЕ
                  |	ВнутреннееПотреблениеТоваровТовары.Количество <> 0
                  |
                  |СГРУППИРОВАТЬ ПО
                  |	ВнутреннееПотреблениеТоваровТовары.Номенклатура,
                  |	ВТ_Итог.ОбъектРемонта,
                  |	ВТ_Итог.ID
                  |;
                  |
                  |////////////////////////////////////////////////////////////////////////////////
                  |ВЫБРАТЬ
                  |	ВТ_Итог.ОбъектРемонта КАК ОбъектРемонта,
                  |	ВТ_Итог.ID КАК ID,
                  |	ВТ_Итог.ИнвентарныйНомер КАК ИнвентарныйНомер,
                  |	ВТ_Итог.Наименование КАК Наименование,
                  |	ПРЕДСТАВЛЕНИЕ(ВТ_Итог.проф_Марка) КАК Марка,
                  |	ВТ_Итог.ЗаводскойНомер КАК ЗаводскойНомер,
//++ Проф-ИТ, #296, Горетовская М.С., 05.10.2023 - Доработки по задаче #128
                  |	ВТ_Итог.ГосНомер КАК ГосНомер,
//-- Проф-ИТ, #296, Горетовская М.С., 05.10.2023 - Доработки по задаче #128
                  |	ВТ_Итог.ЗаявкаНаРемонт КАК ЗаявкаНаРемонт,
                  |	ВТ_Итог.ДатаОкончания КАК Дата,
                  |	ВТ_Итог.ДефектОписание КАК Неисправность,
                  |	ПРЕДСТАВЛЕНИЕ(ВТ_Итог.ПлановыйГрафикРаботы) КАК РежимРаботы,
                  |	ВТ_Итог.ДефектПричина КАК Причина,
                  |	ВТ_Итог.ВремяРаботы КАК ВремяРаботы,
                  |	ВТ_Итог.ВремяПростоя КАК ВремяПростоя
                  |ИЗ
                  |	ВТ_Итог КАК ВТ_Итог";
   
   Если ЗначениеЗаполнено(ОбъектРемонта) Тогда 
	   ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
								 "&ОбъектРемонта",
								 "торо_ВыявленныеДефектыСписокДефектов.ОбъектРемонта = &ОбъектРемонта");
	   Запрос.УстановитьПараметр("ОбъектРемонта", ОбъектРемонта);  
   Иначе
	   ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОбъектРемонта", "ИСТИНА");
   КонецЕсли;    
   
   Возврат ТекстЗапроса;
   
КонецФункции	

&НаСервере
Функция ПолучитьДокументДляПечати()
   
   Табл = Новый ТабличныйДокумент;
   Табл.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
   
   ЭтаОбработка = РеквизитФормыВЗначение("Отчет");
   Макет = ЭтаОбработка.ПолучитьМакет("МакетПечать");
   ОбластьШапкаДокумента = Макет.ПолучитьОбласть("ОбластьШапкаДокумента"); 
   ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ОбластьШапкаТаблицы");  
   
   ОбластьШапкаДокумента.Параметры.текДата = Формат(ТекущаяДатаСеанса(), "ДФ='«dd» MMMM гггг'' г.'''");
   ОбластьШапкаДокумента.Параметры.месяц = Формат(ПериодОтчета.ДатаНачала, "ДФ='MMMM'");
   ОбластьШапкаДокумента.Параметры.год = Формат(ПериодОтчета.ДатаНачала, "ДФ=yyyy");

   Табл.Вывести(ОбластьШапкаДокумента); 
	   
   Запрос = Новый Запрос;
   Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(ПериодОтчета.ДатаНачала));  
   Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(ПериодОтчета.ДатаОкончания));  
   Запрос.Текст = ТекстЗапросаПечатьЖурналУчетаЗаявочныхРемонтовЗаМесяц(ОбъектРемонта, Запрос);	     	   
   РезультатЗапроса = Запрос.ВыполнитьПакет();  
   
   ВыборкаОбъектыРемонта = РезультатЗапроса[5].Выбрать();
   ВыборкаНаработка = РезультатЗапроса[3].Выбрать();
   ВыборкаНоменклатура = РезультатЗапроса[4].Выбрать();
   
   Если ВыборкаОбъектыРемонта.Количество() > 0 Тогда
	   Табл.Вывести(ОбластьШапкаТаблицы); 
   КонецЕсли;
   
   Пока ВыборкаОбъектыРемонта.Следующий() Цикл
	   ОбластьСтрока = Макет.ПолучитьОбласть("ОбластьСтрока");
	   ОбластьСтрока.Параметры.Заполнить(ВыборкаОбъектыРемонта); 
	   ОбластьСтрока.Параметры.Наименование = ВыборкаОбъектыРемонта.Наименование + " " + ВыборкаОбъектыРемонта.Марка; 
	   ОбластьСтрока.Параметры.Пробег = "";
	   ОбластьСтрока.Параметры.Наработка = "";
	   
	   Отбор = Новый Структура;
	   Отбор.Вставить("ОбъектРемонта", ВыборкаОбъектыРемонта.ОбъектРемонта);
	   Отбор.Вставить("ID", ВыборкаОбъектыРемонта.ID);
	   
	   ЗаполнитьПробег(Отбор, ВыборкаНаработка, ОбластьСтрока);	
	   
	   ОбластьСтрока.Параметры.ВремяРаботы = ?(ЗначениеЗаполнено(ВыборкаОбъектыРемонта.ВремяРаботы),
		   Строка(ВыборкаОбъектыРемонта.ВремяРаботы) + ", ч",
		   "");
	   ОбластьСтрока.Параметры.ВремяПростоя = ?(ЗначениеЗаполнено(ВыборкаОбъектыРемонта.ВремяПростоя),
		   Строка(ВыборкаОбъектыРемонта.ВремяПростоя) + ", ч",
		   "");  
	   
	   НоменклатураВыведена = Ложь;
	   
	   МассивСтрокНоменклатуры = ПолучитьМассивСтрокНоменклатуры(Отбор, ВыборкаНоменклатура, ОбластьСтрока, Макет);
					   
	   Если Табл.ПроверитьВывод(МассивСтрокНоменклатуры) = Ложь Тогда
		   Табл.ВывестиГоризонтальныйРазделительСтраниц(); 
		   Табл.Вывести(ОбластьШапкаТаблицы); 
	   КонецЕсли;
	   
	   ВывестиМассивСтрокНоменклатуры(МассивСтрокНоменклатуры, Табл);
				 
	   НоменклатураВыведена = ?(МассивСтрокНоменклатуры.Количество() > 0, Истина, Ложь);  
				   
	   Если Не НоменклатураВыведена
	   И Табл.ПроверитьВывод(ОбластьСтрока) = Ложь Тогда	
		   Табл.ВывестиГоризонтальныйРазделительСтраниц(); 
		   Табл.Вывести(ОбластьШапкаТаблицы);
		   Табл.Вывести(ОбластьСтрока);
	   ИначеЕсли Не НоменклатураВыведена Тогда
		   Табл.Вывести(ОбластьСтрока);			
	   Иначе
		   // Объединим ячейки               
		   ОбъединитьЯчейкиВыведеннойНоменклатуре(Табл, МассивСтрокНоменклатуры.Количество());			
	   КонецЕсли;			
   КонецЦикла;
   
   Возврат Табл;
   
КонецФункции

&НаСервере
Процедура ЗаполнитьПробег(Отбор, ВыборкаНаработка, ОбластьСтрока)
   
   Пока ВыборкаНаработка.НайтиСледующий(Отбор) Цикл
	   ОбластьСтрока.Параметры.Пробег = ОбластьСтрока.Параметры.Пробег + ?(ЗначениеЗаполнено(ВыборкаНаработка.Пробег),
	   									Строка(ВыборкаНаработка.Пробег) + ", км", "");
	   ОбластьСтрока.Параметры.Наработка = ОбластьСтрока.Параметры.Наработка
	   											+ ?(ЗначениеЗаполнено(ВыборкаНаработка.Наработка),
	   													Строка(ВыборкаНаработка.Наработка) + ", ч", "");
	   
   КонецЦикла;
   ВыборкаНаработка.Сбросить();		
   
КонецПроцедуры	

&НаСервере
Функция ПолучитьМассивСтрокНоменклатуры(Отбор, ВыборкаНоменклатура, ОбластьСтрока, Макет)
   
   МассивСтрокНоменклатуры = Новый Массив; 
   
   Пока ВыборкаНоменклатура.НайтиСледующий(Отбор) Цикл 
	   ОбластьСтрокаМассив = Макет.ПолучитьОбласть("ОбластьСтрока");
	   ОбластьСтрокаМассив.Параметры.Заполнить(ОбластьСтрока.Параметры);
	   ОбластьСтрокаМассив.Параметры.Заполнить(ВыборкаНоменклатура);
	   МассивСтрокНоменклатуры.Добавить(ОбластьСтрокаМассив);
   КонецЦикла; 
   ВыборкаНоменклатура.Сбросить();	
   
   Возврат МассивСтрокНоменклатуры;
   
КонецФункции	

&НаСервере
Процедура ВывестиМассивСтрокНоменклатуры(МассивСтрокНоменклатуры, ТабДок)
   
   Для Каждого СтрокаМассив Из МассивСтрокНоменклатуры Цикл
	   ТабДок.Вывести(СтрокаМассив);
   КонецЦикла;	
   
КонецПроцедуры	

&НаСервере
Процедура ОбъединитьЯчейкиВыведеннойНоменклатуре(ТабДок, КоличествоСтрокНоменклатуры)
   
   // Объединим ячейки               
   НачальнаяСтрока = Строка(ТабДок.ВысотаТаблицы - КоличествоСтрокНоменклатуры + 1);
   ВысотаТаблицыСтрокой = Строка(ТабДок.ВысотаТаблицы);
   
//++ Проф-ИТ, #296, Горетовская М.С., 05.10.2023 - Доработки по задаче #128
   //Для Сч = 2 По 13 Цикл 
   //    Если Сч <> 10 И Сч <> 11 Тогда
   Для Сч = 2 По 15 Цикл 
	   Если Сч <> 12 И Сч <> 13 Тогда
//-- Проф-ИТ, #296, Горетовская М.С., 05.10.2023 - Доработки по задаче #128
	   АдресОбласти = СтрШаблон("R%1C%2:R%3C%2", НачальнаяСтрока, Сч,  ВысотаТаблицыСтрокой);
	   ТабДок.Область(АдресОбласти).Объединить();  
	   КонецЕсли;
   КонецЦикла;		
   
КонецПроцедуры	

#КонецОбласти

//-- Проф-ИТ, #128, Башинская А., 25.08.2023
